PH_data/alpha_1.6/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
26895
(
( 9.380619304e-06 -2.521686611e-06 -3.435498286e-08 6.899535492e-06 -4.777417217e-08 1.024313133e-05 )
( 9.072763532e-06 -2.439773652e-06 -3.960994377e-08 6.793772627e-06 -5.582772999e-08 1.020303534e-05 )
( 1.143161899e-05 -2.808169484e-06 -1.64265515e-07 6.708093679e-06 1.779945968e-08 1.195600089e-05 )
( 7.739316061e-06 -2.474685971e-06 9.114930322e-08 7.326729701e-06 -1.121284257e-07 8.461845937e-06 )
( 8.833701941e-06 -2.374651103e-06 -4.079888072e-08 6.707888133e-06 -6.442375167e-08 1.017189334e-05 )
( 1.093646279e-05 -2.648776444e-06 -1.699266079e-07 6.494957233e-06 1.082795009e-08 1.187503858e-05 )
( 1.943450116e-05 -4.729406555e-06 -2.518333133e-07 7.543986612e-06 1.246698815e-07 1.551176683e-05 )
( 7.510047908e-06 -2.434245744e-06 8.870512147e-08 7.298051059e-06 -1.148886e-07 8.486064871e-06 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
