PH_data/alpha_1.6/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
26895
(
( 0.0284450613 -0.0004114636686 -0.0001703016896 )
( 0.02846852317 -0.0003760127584 -0.0001725637412 )
( 0.02825102583 -0.0004417502787 -0.0001517620403 )
( 0.02860730141 -0.0003532682313 -0.000186598365 )
( 0.02848787792 -0.0003489871451 -0.0001744493493 )
( 0.02828802727 -0.0004086803237 -0.0001543619583 )
( 0.02736485749 -0.0005404676776 -0.0001164586938 )
( 0.02863179147 -0.0002902940032 -0.0001891926804 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
